<!--
 * @Description: 
 * @Author: 肖婷
 * @Date: 2019-09-12 23:46:02
 * @LastEditTime: 2019-10-20 15:40:06
 * @LastEditors: 肖婷
 -->
<template>
  <div>
    <!-- <el-table width="100%" height="500" size="small" :data="data" border >
        <el-table-column class-name="ts" :render-header="renderHeader"></el-table-column>
    </el-table> -->
  </div>
</template>
<script>
// import { FormatDate } from '@core/filters'
// import * as services from './services'
// import {zzl} from '../sourceData'
// import searchBar from '../../components/common/searchBar' 
// const zzl={"yAxis":{"saleAmountRateAverage":461401.95,"saleAmountRateMax":922900.0000,"saleAmountRateMin":-96.1000},"profitNegativeData":[],"xAxis":{"saleAmountProportionAverage":9.10,"saleAmountProportionMax":18.2100,"saleAmountProportionMin":0},"sourceData":[[18.2100,323.5700,330.4300,"宅一起 加粗衣架40个装浸塑料成人儿童防滑晾挂钩衣架家用无痕衣撑衣服架"],[10.6000,-62.1000,874.2800,"双枪八合一多功能防滑魔术晾衣架"],[8.5500,-70.2300,-86.0600,"Pericook多功能魔术衣架6只装"],[6.4100,-53.0300,-71.5700,"宅一起 爆款多功能防滑衣架衣柜衣服家用节省空间成人挂衣架"],[5.0100,78.8200,22.7700,"宅一起 加厚大容量洗衣袋护洗袋细网套装清洗衣服文胸内衣洗衣机袋 多规格"],[4.9500,0.3000,13.0200,"品迈干湿两用灰色衣架20支装-带钩防滑"],[4.4900,-44.8800,-69.3400,"宅一起 衣架儿童款60支装 家用无痕多功能晾衣服架防滑衣挂成人衣撑撑子晒挂衣架子"],[3.8600,-25.7200,-25.4500,"宅一起 20只衣架组合装 家用多功能无痕晾衣架衣撑衣挂衣服架成人挂衣架子防滑衣挂"],[2.4500,-49.9100,-49.2300,"宅一起 可伸缩折叠多功能多层裤架裤子衣架家用魔术裤夹衣柜收纳"],[2.1700,149.2600,155.8000,"宅一起 多夹裤夹家用折叠塑料晾衣架子儿童宝宝夹子晾晒挂衣架晒袜子架"],[1.9300,15.8500,9.5500,"浪漫樱花日本酵素洗衣粉800g鲜花清香柔顺剂无荧光剂护色速溶迅速渗透免【2盒装】"],[1.7600,30.4900,-58.4700,"PANPAN盼盼翼型不锈钢落地折叠可移动晒被架晾衣架PP-400U"],[1.7500,-38.7600,-38.1800,"宅一起 20个套装宽肩无痕衣架可旋转成人防滑家用衣撑挂衣架"],[1.7300,922900.0000,19579.9000,"盼盼 落地晾衣架折叠 家用阳台不锈钢卧室室外晾晒架婴儿尿布晒架"],[1.6700,103.7300,95.5400,"宅一起 多功能裤架裤夹6个装家用无痕伸缩裤撑裤挂女裙子带夹子裤子衣架"],[1.5400,-64.1900,-64.3500,"宅一起 1-2个家用伸缩多功能魔术衣架折叠衣撑省空间防滑多层晾衣架"],[1.3700,255.0600,263.7300,"宅一起 20支装衣架家用防滑衣服架子多功能防风衣柜衣撑晾衣架成人晒衣挂"],[1.0900,579600.0000,13330.8000,"盼盼电动晾衣架阳台升降晾衣杆伸缩四杆照明风干消毒室内晒衣架D03"],[1.0100,260.0400,0,"欧兰特智能遥控升降电动晾衣架阳台双杆式母婴烘干晒衣伸缩晾衣机"],[1.0100,536000.0000,109895.3500,"盼盼不锈钢可伸缩落地晾衣架LD-01"],[0.9600,511000.0000,11753.0000,"盼盼升降晾衣架手摇晾衣杆双杆三杆式2.4米晒衣架室内阳台挂衣架家用晒被子晾晒架"],[0.8200,-46.5200,-45.5400,"宅一起 洗衣机过滤网+洗衣球套装 袋漂浮除毛器通用 护洗袋去杂物毛发过滤器洗衣袋"],[0.8000,424200.0000,7794.7000,"盼盼落地单杆落地衣架LD-01"],[0.7400,170.5000,182.1100,"宅一起 多功能晒衣网【两件套】凉羊毛衫平铺的网兜平摊晾晒网毛衣专用防变形晾衣架"],[0.6800,42.7700,35.1600,"宅一起 60个套装大夹子不锈钢晒被晾被子衣服夹子晾衣夹被夹"],[0.6700,-12.7700,-16.0800,"浪漫樱花日本进口拗不断衣架20只装 家用无痕衣撑子多功能衣挂成人晾衣服"],[0.6600,-83.7700,-54.3800,"品迈简约浸塑衣架带凹槽防滑衣架组合40支"],[0.6400,3.0300,-81.1300,"PANPAN盼盼手摇多杆升降阳台晾衣架折室内外晒被架-多款可选"],[0.6300,-9.6700,-7.9200,"宅一起 扁平挂衣架20个装成人防滑衣服架晾衣架子家用衣撑衣柜放衣服架子"],[0.6100,-22.9700,16.6000,"品迈不锈钢20夹圆形线夹加粗晾衣架"],[0.5800,63.6900,54.6000,"【两只装】ABS晾晒系列折叠晒架长方形（40头）"],[0.5800,-3.3600,0.3700,"宅一起 20个装干湿二用衣架家用晒塑料无痕多功能防滑衣撑撑子"],[0.5100,42.6600,41.3300,"H&3 家用防滑无痕塑料晾晒衣架 20入套装衣橱收纳干湿两用"],[0.4900,100.6000,82.6600,"宅一起 20个装儿童伸缩防滑衣架多功能塑料成人二用护肩衣架"],[0.4700,-38.8700,-34.7500,"喜家家 儿童伸缩衣架30个装 可连挂"],[0.4500,241600.0000,4133.1000,"盼盼手摇晾衣架2.4米子母杆晒衣架"],[0.4400,263.3600,276.0200,"宅一起 多功能宽肩无痕连体衣裤架 6件套 可拆卸晾衣服架子成人晒裤子衣架衣撑架"],[0.4300,155.2700,168.2900,"H&3 衣帽间晾衣撑宽肩防滑混色衣架套装"],[0.4200,25.0000,22.7300,"喜家家 加粗不锈钢S型裤架"],[0.4000,-24.4100,-26.7000,"宅一起 太空铝合金衣架10支装 成人无痕衣撑衣架室内不锈钢防滑衣挂家用晾晒"],[0.4000,18.9200,18.9200,"喜家家 实木海绵衣架家用防滑胶棉木头凉衣服架子衣挂衣柜衣撑子大挂衣架"],[0.3900,209500.0000,4818.5000,"盼盼落地晾衣架铝合金折叠PP-320"],[0.3500,109.5200,110.5300,"喜家家 儿童衣架婴儿小孩多功能可伸缩晾衣架"],[0.2800,-20.0000,-82.1900,"PANPAN盼盼X型不锈钢可折叠落地晾衣架挂衣架PP-305A"],[0.2800,149900.0000,3447.7000,"盼盼电动晾衣架自动晾衣杆智能晒衣架 遥控升降阳台凉衣架"],[0.2800,-80.7700,-80.7700,"欧兰特遥控升降电动晾衣架阳台双杆式母婴烘干晒衣被子快速烘干伸缩晾衣机"],[0.2700,-50.0000,-91.3000,"PANPAN盼盼铝合金折叠落地晾衣架PP-320"],[0.2500,25.0000,20.8300,"喜家家 多功能魔术衣架家用多层裤架挂裤子架子挂衣架衣柜收纳架裤夹"],[0.2300,119900.0000,2757.7000,"盼盼电动晾衣架智能升降晾衣杆 阳台自动晾衣机伸缩四杆照明消毒家用晒衣架"],[0.2200,119600.0000,2750.8000,"盼盼晾衣架 落地伸缩双杆式晾衣杆晒衣架 加厚不锈钢可移动挂衣架阳台服装展示架"],[0.2200,169.5500,201.7300,"喜家家 多功能晾袜子晾衣架 可折叠宝宝婴儿衣服 挂内衣内裤袜子架多夹子防风"],[0.2200,118000.0000,2714.0000,"H&3 阳台衣橱衣架30入 加粗防风防滑晾挂架 宿舍晾晒收纳衣撑"],[0.2200,114620.0000,2328.5200,"ABS 可撕式粘毛器粘尘器除尘器加长滚筒式大衣刷粘毛器10卷替芯"],[0.2000,57.1400,83.3300,"欧兰特电动晾衣架铝质衣撑10个装电动晾衣机配件"],[0.2000,105800.0000,23189.4000,"盼盼不锈钢落地折叠阻尼晾衣架LZ-04"],[0.2000,320.0000,320.0000,"ABS 炫彩防脱落晾晒衣架-8件组"],[0.1900,40.0000,40.0000,"喜家家  洗衣袋6件套 护衣细网护洗袋 清洗衣物文胸袋网袋套装"],[0.1800,-33.3300,-91.5000,"盼盼翼型铝合金落地折叠晾衣架晾衣杆LZ-03"],[0.1700,87990.0000,1932.0000,"宅一起 晒鞋架6只 防风创意晒鞋架挂钩式夹晒晾鞋架晾晒架子塑料多功能折叠阳台挂式"],[0.1500,79230.0000,1532.4900,"卡贝防滑衣架宿舍晾衣架衣服架衣撑不锈钢衣架实心 加粗衣挂 家用10个20个装"],[0.1300,-37.4200,-40.9900,"喜家家 单/双层晾衣网晒衣篮晾晒 毛衣玩具袜子专用网兜羊毛衫晾衣架"],[0.1300,0.7400,0.7400,"【两只装】ABS晾晒系列折叠晒架方形（26头）"],[0.1300,280.9100,280.9100,"盼超可撕式粘毛器家用黏衣物滚刷衣服粘毛刷除毛器滚筒"],[0.1200,0.0000,0.0000,"尚烤佳 围裙 韩版公主围裙 工字背家居围裙 厨房烘焙围裙 带套袖 两套装"],[0.1200,0.0000,-9.0900,"喜家家 内衣裤晾晒夹子袜子多功能夹子"],[0.1100,68.5600,51.7000,"品迈加厚加长耐用塑料搓衣板"],[0.1100,57860.0000,1330.7800,"奇居良品 围裙韩版时尚创意欧式字母布艺围裙厨房家居半身围裙"],[0.1000,1000.0000,1000.0000,"盼超大衣刷吸毛器衣物粘毛器除毛器毛呢刷衣服除毛刷除尘刷去静电"],[0.1000,53900.0000,1239.7000,"盼盼落地晾衣架 阳台晒衣架 伸缩双杆式晾衣杆室内室外家用可移动挂衣架服装展示架"],[0.0900,-61.6100,-48.4200,"品迈防滑无痕西装套装实木衣架4只装"],[0.0900,93.7400,93.7400,"宅一起 衣架家用晒衣架塑料无痕多功能防滑衣撑衣挂女晾大衣服架挂衣架子"],[0.0700,34900.0000,802.7000,"盼盼落地晾衣架不锈钢X型PP-305A"],[0.0600,-41.6700,-41.6700,"喜家家 晾晒篮 毛衣玩具内衣裤袜子晾晒篮 "],[0.0500,300.0000,300.0000,"欧兰特多功能百变收纳折叠晾晒多层防滑旋转魔术便捷衣架子挂衣架"],[0.0400,500.2500,500.2500,"【3件装】ABS 小白鞋护理保养增白剂"],[0.0300,15960.0000,367.0800,"卡贝可爱被子固定器防跑踢卡扣床单被套罩角夹子隐形家用安全无针神器8个16个装"],[0.0300,-42.8600,-42.8600,"H&3 家居客厅沙发抱枕免水洗酵素布艺清洁剂  污渍地毯干洗剂"],[0.0100,-96.1000,-94.1100,"品迈扁平干湿两用防滑衣架20只装"],[0.0100,5900.0000,135.7000,"盼盼晾衣架多功能无痕衣架家用衣服架子卧室防滑衣撑铝合金衣服挂PP-1144"],[0.0100,5600.0000,128.8000,"（两只装）多功能衣架魔术衣架子挂衣架家用收纳神器多层折叠抖音衣撑晾衣架"],[0.0100,4990.0000,114.7700,"ABS 便携式折叠脸盆洗菜盆收纳盆旅行盆"]]}

export default {
  name: 'bostonMatrix',
  data() {
    return {
      content:'123',
      columns7: [
          {
            title: '序号',
            type: 'index',
            width: 200
          },
          {
            title: '新批次',
            width: 350,
            key:'newLots'
          },
          {
            title: '数量',
            key: 'numLots',
            width: 350,
            align: 'center',
            render: (h, params) => {
              var vm = this;
              return h('div', [

                h('Input', {
                  props: {
                  //将单元格的值给Input
                  value:params.row.numLots,
                  },
                  on:{
                       'on-change' (event) { 
                          //值改变时 
                          //将渲染后的值重新赋值给单元格值     
                          params.row.numLots = event.target.value;
                          vm.data[params.index] = params.row;
                      } 
                   }
                },)
              ]);
            }
          },
          {
            title: '操作',
            key: 'action',
            width: 350,
            align: 'center',
            render: (h, params) => {
              return h('div', [
                h('Button', {
                  props: {
                    type: 'error',
                    size: 'default'
                  },
                  style: {
                    marginRight: '5px'
                  },
                  on: {
                    click: () => {
                      this.openDeleteDialog(params.index)
                    }
                  }
                }, '删除')
              ]);
            }
          }

        ],
        data: [{}],
    }
  },
//   components:{searchBar},
  created() {
   
  },
  mounted() {
      this.open()
  },
  methods:{
      renderHeader() {
        return (
            <el-input type="text" v-model={this.content}></el-input>
        )
    },
      handleClick(){console.log('click')},
       open() {
        const h = this.$createElement;
        var self = this
        this.$msgbox({
          title: '消息',
          message:this.renderHeader(),
          dangerouslyUseHTMLString: true,
        //   message: self.renderHeader(h),
        //   message: h('p', null, [
        //     h('span', null, '内容可以是 '),
        //     h('i', { style: 'color: teal' }, 'VNode'),
        //     h('el-input',{
        //         attrs:{type:'textarea',rows:6},
        //         props:{
        //             value:this.content
        //         },
        //         'v-model':this.content,
        //         on:{
        //             input:function(event){
        //                 console.log(event)
        //                 this.content = event
        //                 // change:self.$emit('input', self.content)
        //                 // self.$emit('input', event.target.value)
        //             }
        //         }
        //     })
        //   ]),
        // message:  (
        //     <div onClick={this.handleClick}>
        //         这是一段文字
        //         <el-input size="small" type="textarea" rows="6" v-model={this.content}>查看详情</el-input>
        //     </div>
        //     ),
          showCancelButton: true,
          confirmButtonText: '确定',
          cancelButtonText: '取消',
          beforeClose: (action, instance, done) => {
            if (action === 'confirm') {
              instance.confirmButtonLoading = true;
              instance.confirmButtonText = '执行中...';
              setTimeout(() => {
                done();
                setTimeout(() => {
                  instance.confirmButtonLoading = false;
                }, 300);
              }, 3000);
            } else {
              done();
            }
          }
        }).then(action => {
          this.$message({
            type: 'info',
            message: 'action: ' + action
          });
        });
      }
  }
  
}
</script>
<style lang="scss" scoped>

</style>